/*
   Localizable.strings - Japanese
   modizer

   Organized by screens and feature families
*/

// ================================
// MARK: - COMMON / GENERAL
// ================================

/* Common Actions */
"Yes" = "はい";
"No" = "いいえ";
"Ok" = "OK";
"Cancel" = "キャンセル";
"Close" = "閉じる";
"Save" = "保存";
"Delete" = "削除";
"Rename" = "名前変更";
"Extract" = "展開";
"Cut" = "切り取り";
"Paste" = "貼り付け";
"Create" = "作成";
"Reset" = "リセット";

/* Common States */
"Loading" = "読み込み中";
"Extracting" = "展開中";
"Seeking" = "シーク中";
"Seeking %d%%" = "シーク中 %d%%";
"Refreshing" = "更新中";
"Browsing" = "ブラウズ中";
"Cancelling..." = "キャンセル中...";

/* Common Messages */
"Error" = "エラー";
"OK" = "OK";
"Warning" = "警告";
"Do you want to reset to default value:\n" = "デフォルト値にリセットしますか:\n";


// ================================
// MARK: - BROWSER
// ================================

/* Browser Main Keys */
"Browser_LocalBrowsing_MainKey" = "ローカルファイル";
"Browser_LocalBrowsing_SubKey" = "ローカルファイルの閲覧、再生、削除";

"Browser_MODLAND_MainKey" = "MODLANDコレクション";
"Browser_MODLAND_SubKey" = "%d ファイル";

"Browser_HVSC_MainKey" = "HVSCコレクション";
"Browser_HVSC_SubKey" = "%d ファイル";

"Browser_Playlists_MainKey" = "プレイリスト";
"Browser_Playlists_SubKey" = "整理、作成、削除、再生";

"Browser_Favorites_MainKey" = "お気に入り";
"Browser_Favorites_SubKey" = "評価した曲を再生";

"Browser_Most_played_MainKey" = "よく再生";
"Browser_Most_played_SubKey" = "よく再生される曲を再生";

"Browser_Web_MainKey" = "ウェブ";
"Browser_Web_SubKey" = "インターネットで音楽をダウンロード";

"Browser_WorldCharts_MainKey" = "ワールドチャート";
"Browser_WorldCharts_SubKey" = "トップリストとダウンロードリンク";

"Browser_WebVGM_MainKey" = "VGMRips";
"Browser_WebVGM_SubKey" = "ゲーム音楽リップ";

"Browser_UserGuide_MainKey" = "ユーザーガイド";
"Browser_UserGuide_SubKey" = "マニュアル、FAQ、ヒント";

/* Browser Display Modes */
"GetAllEntries_MainKey" = "不足エントリを取得";
"GetAllEntries_SubKey" = "最初の256件に制限";

"DisplayAll_MainKey" = "名前順で全て表示";
"DisplayAll_SubKey" = "現在のディレクトリ:";

"DisplayDir_MainKey" = "リスト/ディレクトリ";
"DisplayDir_SubKey" = "パス順:";

"DisplayAllPath_MainKey" = "パス順で全て表示";
"DisplayAllPath_SubKey" = "名前順:";

/* Browser View Modes */
"Formats/Artists/Files" = "形式/アーティスト/ファイル";
"Artists/Formats/Files" = "アーティスト/形式/ファイル";
"Artists/Files" = "アーティスト/ファイル";
"Formats: %d entries." = "形式: %d 件";
"Artists: %d entries." = "アーティスト: %d 件";

/* Browser Stats */
"Played %d times." = "%d 回再生";
"Played once." = "1回再生";
"Never played." = "未再生";
"%d files." = "%d ファイル";
"1 file." = "1 ファイル";
"Size: %dKB" = "サイズ: %dKB";

/* Browser Messages */
"Browser not enough mem." = "エントリが多すぎてメモリを確保できません";
"Browser not enough mem. Limited." = "エントリが多すぎてメモリを確保できません。リストは不完全です";

/* File Operations */
"New folder" = "新規フォルダ";
"Enter folder name" = "フォルダ名を入力";
"Nothing to paste" = "貼り付けるものがありません";
"No file to extract or not supported archive format.\n" = "展開するファイルがないか、サポートされていないアーカイブ形式です\n";
"Cannot use iCloud as folder name" = "iCloudはフォルダ名として使用できません";

"Issue %d while trying to delete entry.\n%@" = "エントリの削除中に問題が発生しました %d\n%@";
"Issue %d while trying to renamefile.\n%@" = "ファイル名の変更中に問題が発生しました %d\n%@";
"Issue %d while moving: %@.\n%@" = "移動中に問題が発生しました %d: %@\n%@";
"Issue %d while creating folder\n%@" = "フォルダ作成中に問題が発生しました %d\n%@";

"File is not available locally.\nTrigerring download from iCloud, please check in 'Files' application." = "ファイルがローカルにありません\niCloudからダウンロードを開始します。「ファイル」アプリで確認してください";

"unavailable" = "利用不可";

// ================================
// MARK: - SEARCH
// ================================

/* Search States */
"Playlist (%d)" = "プレイリスト (%d)";
"Playlist/Search off" = "プレイリスト/検索オフ";

"Local (%d, limited to %d)" = "ローカル (%d、%d件まで)";
"Local (%d)" = "ローカル (%d)";
"Local/Search off" = "ローカル/検索オフ";

"Modland (%d, limited to %d)" = "Modland (%d、%d件まで)";
"Modland (%d)" = "Modland (%d)";
"Modland/Search off" = "Modland/検索オフ";

"HVSC (%d, limited to %d)" = "HVSC (%d、%d件まで)";
"HVSC (%d)" = "HVSC (%d)";
"HVSC/Search off" = "HVSC/検索オフ";

"ASMA (%d, limited to %d)"="ASMA (%d、%d件まで)";
"ASMA (%d)"="ASMA (%d)";
"ASMA/Search off"="ASMA/検索オフ";

/* Search Messages */
"Searching Playlists..." = "プレイリストを検索中...";
"Searching Local files..." = "ローカルファイルを検索中...";
"Searching MODLAND..." = "MODLANDを検索中...";
"Searching HVSC..." = "HVSCを検索中...";

"Please enter at least 2 characters for your search." = "検索するには2文字以上入力してください";
"Please activate at least 1 section for your search." = "検索するには1つ以上のセクションを有効にしてください";


// ================================
// MARK: - PLAYER / NOW PLAYING
// ================================

/* Player States */
"Now playing" = "再生中";
"Now playing(%d)" = "再生中(%d)";
"Most played" = "よく再生";
"Favorites" = "お気に入り";
"Resuming last\nplayed file" = "前回再生した\nファイルを再開";

/* Player Controls */
"Previous" = "前へ";
"Previous file" = "前のファイル";
"Next file" = "次のファイル";
"Next" = "次へ";
"Shuffle" = "シャッフル";
"Voices control" = "ボイスコントロール";
"All voices" = "全ボイス";
"Clear 'Now Playing' queue" = "「再生中」キューをクリア";

/* Song Selection */
"Choose a subsong" = "サブソングを選択";
"Choose a song" = "曲を選択";

/* Player Messages */
"Nothing currently playing. Please select a file." = "現在再生中のファイルはありません。ファイルを選択してください";
"File cannot be played. Skipping to next playable file." = "ファイルを再生できません。次の再生可能なファイルへスキップします";
"Too much entries! Playlist will be limited to %d first entries." = "エントリが多すぎます。プレイリストは最初の%d件に制限されます";
"Playlist is full. Delete some entries to add more." = "プレイリストがいっぱいです。追加するにはエントリを削除してください";

/* Metadata */
"unknown_title" = "不明なタイトル";
"unknown_album" = "不明なアルバム";
"now_playing_format" = "再生中: %@（%@より）";


// ================================
// MARK: - PLAYLISTS
// ================================

/* Playlist Actions */
"New playlist" = "新規プレイリスト";
"Create new playlist" = "新規プレイリストを作成";
"Save current one" = "現在のプレイリストを保存";
"Rename playlist" = "プレイリスト名を変更";
"Add to a playlist" = "プレイリストに追加";
"Choose a playlist" = "プレイリストを選択";

/* Playlist Descriptions */
"Create a new empty playlist." = "新しい空のプレイリストを作成";
"Create a playlist from currently played files." = "現在再生中のファイルからプレイリストを作成";
"Browse files" = "ファイルを参照";
"Add or remove entries from browser." = "ブラウザからエントリを追加または削除";
"Choose a new name." = "新しい名前を選択";

/* Playlist Confirmations */
"Are you sure you want to delete this playlist ?" = "このプレイリストを削除してもよろしいですか？";
"Are you sure you want to delete this entry ?" = "このエントリを削除してもよろしいですか？";


// ================================
// MARK: - DOWNLOADS
// ================================

"Downloads" = "ダウンロード";
"Download queue: 1 file" = "ダウンロード待機: 1ファイル";
"Download queue: %d files" = "ダウンロード待機: %dファイル";
"No download in progress" = "ダウンロード中のファイルはありません";
"Downloaded %@" = "%@ をダウンロード完了";
"Downloading %@" = "%@ をダウンロード中";
"Cannot download from this URL." = "このURLからダウンロードできません";
"Could not add files. Please check manually with file browser (Local Browsing/Downloads)." = "ファイルを追加できませんでした。ファイルブラウザ（ローカルファイル/ダウンロード）で手動で確認してください";
"File already available locally. Do you want to download it again?" = "ファイルは既にローカルにあります。再度ダウンロードしますか？";
"URL have to start with ftp:// or http://" = "URLはftp://またはhttp://で始まる必要があります";
"Cannot connect to FTP." = "FTPに接続できません";


// ================================
// MARK: - DATABASE
// ================================

"Database created." = "データベースを作成しました";
"Database will now be recreated. Please validate & wait." = "データベースを再作成します。確認してお待ちください";
"Wrong database version: %d.%d. Will update to %d.%d. Please validate & wait." = "データベースのバージョンが正しくありません: %d.%d。%d.%dに更新します。確認してお待ちください";
"No database found. Will create a new one. Please validate & wait..." = "データベースが見つかりません。新しいデータベースを作成します。確認してお待ちください...";


// ================================
// MARK: - COVERS / IMAGES
// ================================

"Image detected" = "画像を検出";
"Choose_SaveCover" = "%@ のカバーとして画像を保存しますか？";
"CoverFolder" = "フォルダカバーとして";
"CoverFile" = "ファイルカバーとして";
"Confirm_RemCurCovers" = "%@ の現在のカバー（フォルダとファイル）を削除しますか？";


// ================================
// MARK: - SETTINGS - GENERAL
// ================================

/* Settings Sections */
"Settings_General" = "一般";
"Settings_Player" = "プレイヤー";
"Settings_Display" = "表示";
"Settings_Download" = "ダウンロード";
"Settings_FTP" = "FTP";
"Settings_PlaybackLib" = "再生ライブラリ";
"Settings_Settings" = "設定";

/* Settings Presets */
"Settings_SettingsDefault" = "デフォルト";
"Settings_SettingsHigh" = "高";
"Settings_SettingsMed" = "中";
"Settings_SettingsLow" = "低";

"Confirm_SettingsDef" = "設定を「デフォルト」値にリセットしてもよろしいですか？";
"Confirm_SettingsHigh" = "設定を「高」値にリセットしてもよろしいですか？";
"Confirm_SettingsMed" = "設定を「中」値にリセットしてもよろしいですか？";
"Confirm_SettingsLow" = "設定を「低」値にリセットしてもよろしいですか？";

/* Global Player Settings */
"Search: simplified regexp ('.'->'\\.', '*'->'.*')" = "検索: 簡易正規表現 ('.'->'\\\\.', '*'->'.*')";
"Resume position on launch" = "起動時に位置を復元";
"Notification" = "通知";
"Notification duration" = "通知表示時間";
"Disable screen auto lock" = "画面の自動ロックを無効化";
"No screen auto lock" = "画面の自動ロックなし";
"Enable playback ratio" = "再生レートを有効化";
"Playback ratio" = "再生レート";
"Default length" = "デフォルト長さ";
"Default length %d:%.2d" = "デフォルト長さ %d:%.2d";
"Fade-out time" = "フェードアウト時間";
"Silence Detection" = "無音検出";
"Stop song if silent for more than selected number of seconds. 0: off" = "指定秒数以上無音の場合に曲を停止。0: オフ";
"Will skip song if nothing is played for specified duration (0=off)" = "指定時間何も再生されない場合に曲をスキップ (0=オフ)";
"Force mono" = "強制モノラル";
"Panning" = "パンニング";
"Panning value" = "パンニング値";
"Audio latency" = "オーディオレイテンシ";
"Audio latency in ms" = "オーディオレイテンシ (ms)";
"Multi default action" = "マルチデフォルトアクション";
"Browse" = "ブラウズ";
"Archive/multi play mode" = "アーカイブ/マルチ再生モード";
"Entry"="エントリ";

/* Archive Settings */
"Archive multi default action" = "アーカイブマルチデフォルトアクション";
"Archive multi play mode" = "アーカイブマルチ再生モード";

/* Playlist Settings */
"Play/Enqueue action" = "再生/キュー追加アクション";
"Enqueue mode" = "キュー追加モード";
"Default Action" = "デフォルトアクション";
"Play" = "再生";
"Enqueue" = "キューに追加";
"Enq.&Play" = "追加して再生";
"First" = "最初";
"Current" = "現在";
"Last" = "最後";
"Enqueue position" = "キュー追加位置";
"Post download action" = "ダウンロード後のアクション";
"Nothing" = "なし";

/* Display Settings */
"Background mode" = "バックグラウンドモード";
"Partial" = "部分的";
"Full" = "完全";
"Off=no background process, Partial=keep playing music, Full=keep app on in background" = "オフ=バックグラウンド処理なし、部分的=音楽再生を継続、完全=バックグラウンドでアプリを維持";
"Long name truncate" = "長い名前の省略";
"Head" = "先頭";
"Mid." = "中央";
"Tail" = "末尾";
"Filename as title" = "ファイル名をタイトルに";

/* Local Files Settings */
"Auto. restore Samples folder" = "サンプルフォルダを自動復元";
"Send statistics" = "統計情報を送信";


// ================================
// MARK: - SETTINGS - DATABASE
// ================================

"Settings_DB" = "データベース";
"Settings_CleanDB" = "データベースをクリーン";
"Settings_ResetPlCnt" = "再生回数をリセット";
"Settings_ResetRatings" = "評価をリセット";
"Settings_ResetDB" = "データベース全体をリセット";

"Confirm_DBClean" = "データベースのクリーニングを開始しますか（時間がかかる場合があります）？";
"Confirm_Reset_PlCnt" = "すべての再生回数をリセットしてもよろしいですか？";
"Confirm_Reset_Ratings" = "すべての評価をリセットしてもよろしいですか？";
"Confirm_ResetDB" = "データベース全体をリセットしてもよろしいですか？プレイリスト、評価、再生回数が削除されます";


// ================================
// MARK: - SETTINGS - LOCAL FILES
// ================================

"Settings_LocalFiles" = "ローカルファイル";
"Settings_RecreateSamples" = "「サンプル」フォルダを再作成";
"Settings_FormatDownloads" = "「ダウンロード」フォルダをフォーマット";
"Settings_RemCovers" = "カバーを削除";
"Settings_UpdateFilesBackupFlag" = "ファイルシステムをチェック";

"Confirm_RecreateSamples" = "「サンプル」フォルダを再作成しますか";
"Confirm_FormatDownloads" = "ローカルファイル/ウェブフォルダからすべてのファイルを削除しますか";
"Confirm_CheckFiles" = "ローカルファイルシステムのチェックを実行しますか？";


// ================================
// MARK: - SETTINGS - PLUGINS
// ================================

/* AdPlug */
"OPL type" = "OPLタイプ";
"Stereo surround" = "ステレオサラウンド";

/* GBSPlay */
"HP filter type" = "HPフィルタタイプ";
"Highpass filter type" = "ハイパスフィルタタイプ";

/* Game Music Emu (GME) */
"Stereo separation" = "ステレオセパレーション";
"Ignore silence" = "無音を無視";
"Silence detection" = "無音検出";
"Equalizer" = "イコライザ";
"Bass" = "低音";
"Treble" = "高音";

/* GSF */
"Sound quality" = "音質";
"Interpolation" = "補間";
"Low-pass filter" = "ローパスフィルタ";
"Echo" = "エコー";

/* Highly Complete (HC) */
"Resample quality" = "リサンプル品質";
"Main enabled" = "メイン有効";
"Reverb enabled" = "リバーブ有効";

/* NSFPlay */
"NSFPLAY default length" = "NSFPLAYデフォルト長さ";
"LPF strength" = "LPF強度";
"Min=off, default: 112" = "最小=オフ、デフォルト: 112";
"HPF strength" = "HPF強度";
"Region" = "リージョン";
"VRC7 Patches" = "VRC7パッチ";
"Force IRQ" = "IRQを強制";
"Quality" = "品質";

/* OpenMPT */
"Master volume" = "マスターボリューム";
"Sampling" = "サンプリング";
"Resampling" = "リサンプリング";

/* SID */
"Engine" = "エンジン";
"Filter" = "フィルタ";
"Force loop" = "ループを強制";
"Clock" = "クロック";
"Model" = "モデル";
"Force 2nd SID" = "2ndSIDを強制";
"Address 2nd" = "2ndアドレス";
"0xD420-0xD7FF or 0xDE00-0xDFFF" = "0xD420-0xD7FF または 0xDE00-0xDFFF";
"Force 3rd SID" = "3rdSIDを強制";
"Address 3rd" = "3rdアドレス";

/* Timidity */
"Max loop" = "最大ループ";
"MIDI polyphony" = "MIDI同時発音数";
"Amplification" = "アンプリフィケーション";
"Chorus" = "コーラス";
"Reverb" = "リバーブ";
"Resample" = "リサンプル";
"LP filter" = "LPフィルタ";

/* UADE */
"Headphones" = "ヘッドフォン";
"LED filter" = "LEDフィルタ";
"Normalization" = "ノーマライゼーション";
"Post FX" = "ポストFX";
"Panning" = "パンニング";
"Panning value" = "パンニング値";
"Gain" = "ゲイン";
"Gain value" = "ゲイン値";
"Force NTSC" = "NTSCを強制";

/* VGMPlay */
"Prefer JTAG" = "JTAGを優先";
"YM2612 emulator" = "YM2612エミュレータ";
"Nuked OPN2 option" = "Nuked OPN2オプション";
"YMF262 emulator" = "YMF262エミュレータ";
"YM3812 emulator" = "YM3812エミュレータ";
"QSound emulator" = "QSoundエミュレータ";
"RF5C68 emulator" = "RF5C68エミュレータ";

/* VGMStream */
"Max loop" = "最大ループ";

/* XMP */
"Amiga 500 Filter" = "Amiga 500フィルタ";


// ================================
// MARK: - SETTINGS - VISUALIZATIONS
// ================================

/* General FX */
"FX Alpha" = "FXアルファ";
"FX Fullscreen" = "FXフルスクリーン";
"FX FPS" = "FX FPS";
"FX show info" = "FX情報表示";
"Tech Info" = "技術情報";
"Show FPS and other infos (CPU, Resolution, ProjectM audio data)" = "FPSとその他の情報を表示（CPU、解像度、ProjectMオーディオデータ）";
"FX Level of details" = "FX詳細レベル";
"Low" = "低";
"Med" = "中";
"High" = "高";
"Slow FX limit" = "遅いFX制限";
"Deactivate FX if too slow." = "遅すぎる場合にFXを無効化";
"Weak" = "弱";
"Strong" = "強";
"Display song info" = "曲情報を表示";
"When in fulllscreen, display song info when it changes. TL is Top Left, DR is Bottom Right, C is Center." = "フルスクリーン時、曲が変わったときに曲情報を表示。TL=左上、DR=右下、C=中央";

/* ProjectM */
"ProjectM settings" = "ProjectM設定";
"ProjectM on/off" = "ProjectM オン/オフ";
"Show preset label" = "プリセットラベルを表示";
"Auto switch presets mode" = "プリセット自動切替モード";
"Lock preset" = "プリセットをロック";
"Time between preset" = "プリセット間隔";
"Blend presets" = "プリセットをブレンド";
"Blend time" = "ブレンド時間";
"Bundled presets" = "バンドルプリセット";
"Custom presets" = "カスタムプリセット";
"Aspect ratio" = "アスペクト比";
"Mesh size X" = "メッシュサイズX";
"Mesh size Y" = "メッシュサイズY";
"Hard cut enabled" = "ハードカット有効";
"Hard cut min time" = "ハードカット最小時間";
"Hard cut sensitivity" = "ハードカット感度";
"Beat sensitivity" = "ビート感度";
"Permissive mode" = "寛容モード";

/* Oscilloscope */
"Oscillo settings" = "オシロスコープ設定";
"FX mode" = "FXモード";
"Show label" = "ラベルを表示";
"Label font size" = "ラベルフォントサイズ";
"Show grid" = "グリッドを表示";
"Grid color" = "グリッド色";
"Line width" = "線の幅";
"Mono color" = "モノカラー";
"Multi color set" = "マルチカラーセット";
"Reset all colors" = "すべての色をリセット";
"Thin" = "細";
"Medium" = "中";
"Thick" = "太";
"Beefy" = "極太";

/* Piano Roll / MIDI */
"Piano roll" = "ピアノロール";
"Activate Piano roll FX, standard or 'Synthesia' like" = "ピアノロールFXを有効化（標準または「Synthesia」風）";
"Activate spark FX, colored or white" = "スパークFXを有効化（カラーまたは白）";
"Display voices labels" = "ボイスラベルを表示";
"Display octaves labels" = "オクターブラベルを表示";
"MIDI pattern" = "MIDIパターン";
"MIDI cut line" = "MIDIカットライン";
"MIDI bar style" = "MIDIバースタイル";
"MIDI bar vibrato" = "MIDIバービブラート";
"Piano 3D" = "ピアノ3D";
"Piano cut line" = "ピアノカットライン";
"Piano color mode" = "ピアノカラーモード";

/* Spectrum */
"3D spectrum" = "3Dスペクトラム";
"3D spectrum bloom" = "3Dスペクトラムブルーム";
"Spectrum" = "スペクトラム";
"3D landscape" = "3Dランドスケープ";
"3D landscape bloom" = "3Dランドスケープブルーム";

/* MOD Pattern */
"MOD pattern" = "MODパターン";
"MOD pattern BG alpha" = "MODパターン背景アルファ";
"MOD pattern vol bar" = "MODパターンボリュームバー";
"MOD pattern current line mode" = "MODパターン現在行モード";
"MOD pattern font" = "MODパターンフォント";
"MOD pattern font size" = "MODパターンフォントサイズ";
"MOD pattern theme" = "MODパターンテーマ";


// ================================
// MARK: - WEB BROWSER
// ================================

"Browser_Welcome_Message" = "<b>Modizerのウェブブラウザへようこそ！</b><br><br>上のアドレスバーを使用してナビゲートするか、ブックマークを探索してください。<br><br>画像をカバーとして使用するには、長押し（iOS）または右クリック（macOS）でクリップボードにコピーしてください。";
"Bookmarks" = "ブックマーク";


// ================================
// MARK: - ABOUT
// ================================

"About_Text" = "v4.2 © Yohann Magnien / YoyoFR\n\n連絡先: mailto:modizerhelp@gmail.com\nウェブ: https://modizer.app\n\nModizerのロゴ by Steve Miele。\n\nサポートするファイル形式/拡張子の数: 1108.\n!PM!,003,04SW,208,2DX9,2PSF,2SF,2SFLIB,3DO,4,40A,40B,41A,4V,50A,60A,61A,669,800,9TAV,A2M,A2T,AAC,AAM,AAX,ABK,AC1,AC1D,ACB,ACM,ACX,ADL,ADLIB,ADM,ADP,ADPCM,ADPCMX,ADS,ADSC,ADW,ADX,AFC,AFS2,AGD,AGI,AGSC,AHV,AHX,AI,AIF,AIF-LOOP,AIFC,AIFCL,AIFF,AIFFL,AIX,AKB,AL,AL2,ALP,AMC,AMD,AMF,AMS,AMTS,AO,AON,AON4,AON8,AP,APC,APE,ARP,AS0,AS3M,AS4,ASC,ASD,ASF,ASR,ASS,AST,AT3,AT9,ATSL,ATSL3,ATSL4,ATX,AUD,AUS,AVAL,AVP,AWB,AWC,AY,B1S,BAF,BAKA,BAM,BANK,BAO,BAR,BCSTM,BCWAV,BD,BD3,BDS,BDSP,BFC,BFSTM,BFWAV,BFWAVNSMBU,BG00,BGM,BGW,BH2PCM,BIK,BIK2,BIKA,BIN,BK2,BLK,BMDX,BMF,BMS,BNK,BNM,BNS,BNSF,BO2,BP,BP3,BRSTM,BRSTMSPM,BSF,BSI,BSND,BSS,BTSND,BVG,BWAV,BYTES,C64,C67,CAF,CAPDSP,CBD2,CC3,CCC,CD,CFF,CFN,CHAN,CHI,CHK,CHP,CIN,CKB,CKD,CKS,CM,CM3,CMC,CMF,CMR,CMS,CNK,COP,CORE,CP,CPK,CPLX,CPS,CRB,CSB,CSMP,CTRL,CUS,CUST,CUSTOM,CVS,CWAV,CXS,D00,DA,DAT,DATA,DAX,DB,DBM,DCS,DCT,DDSP,DE2,DEC,DFM,DH,DI,DIGI,DIVA,DL,DLM1,DLM2,DLN,DLT,DL_DELI,DM0,DM1,DM2,DMC,DMF,DMM,DMO,DMSG,DMU,DMU2,DNS,DODA,DP,DR0,DRO,DS2,DSB,DSC,DSF,DSFLIB,DSM,DSP,DSPW,DSQ,DSR,DSS,DST,DSYM,DTK,DTM,DUM,DVI,DW,DWOLD,DXH,DZ,E4X,EA,EAM,EAS,EMFF,EMOD,EMS,EMSV6,ENM,ENO,ENS,ESV,ET1,EU,EUP,EX,EXA,EZW,FAG,FAR,FC,FC-BSI,FC-M,FC13,FC14,FC3,FC4,FCM,FDA,FDI,FFW,FILP,FLAC,FLX,FMB,FNK,FP,FRED,FSB,FST,FSV,FT,FTC,FUZ,FUZZ,FW,FWAV,FWSE,G1L,GAM,GAMPLUS,GBR,GBS,GBTS,GCA,GCM,GCUB,GCW,GDM,GENH,GIN,GLUE,GM,GMC,GMS,GOT,GRAY,GSB,GSF,GSFLIB,GT2,GTD,GTK,GTR,GV,GWM,GYM,H4M,HA2,HAB,HBT,HCA,HD,HDR,HES,HGC1,HIP,HIP7,HIPC,HIS,HMC,HN,HPS,HRM,HRP,HRT,HRT!,HSC,HSF,HSP,HSQ,HST,HVL,HWAS,HX2,HX3,HXC,HXD,HXG,HXX,IAB,IADP,ICE,IDMSF,IDSP,IDVI,IDWAV,IDXMA,IFS,IKM,ILD,IMA,IMC,IMF,IMS,IMX,INSTR,INS,INT,IS,IS14,IS20,ISB,ISD,ISWS,IT,IT1,ITL,IVAG,IVAUD,IVB,J2B,JAM,JBM,JC,JCB,JCBO,JD,JMF,JO,JOE,JP,JPN,JPND,JPO,JPOLD,JSTM,JT,KAT,KCES,KCEY,KEF,KEF7,KH,KM9,KNS,KOVS,KRAW,KRIS,KRS,KSM,KSS,KTAC,KTSL2ASBIN,KTSS,KVS,L,LAA,LAAC,LAIF,LAIFC,LAIFF,LASF,LAX,LBIN,LDS,LEG,LEP,LIN,LION,LIQ,LM0,LM1,LM2,LM3,LM4,LM5,LM6,LM7,LME,LMP3,LMP4,LOGG,LOPUS,LP,LPCM,LPK,LPS,LRMB,LSE,LSF,LSTM,LWAV,LZS,M,M15,M2,M3U,M4A,M4V,MA,MAB,MAD,MAP,MATX,MAX,MBM,MC,MC3,MCA,MCADPCM,MCG,MCMD,MCMD_ORG,MCO,MCR,MD,MDAT,MDI,MDL,MDS,MDSP,MDST,MDX,MDY,MED,MEXXMP,MFP,MG,MGS,MI4,MIB,MIC,MID,MIDI,MIHB,MINI2SF,MINIDSF,MINIGSF,MININCSF,MINIPSF,MINIPSF2,MINIQSF,MINISNSF,MINISSF,MINIUSF,MJB,MK2,MKF,MKII,MKIIO,MKJ,ML,MM4,MM8,MMCMP,MMD0,MMD1,MMD2,MMD3,MMD4,MMDC,MMS,MNSTR,MO3,MOD,MOD15,MOD15_MST,MOD15_ST-IV,MOD15_UST,MOD_ADSC4,MOD_COMP,MOD_DOC,MOD_FLT4,MOD_NTK,MOD_NTK1,MOD_NTK2,MOD_NTKAMP,MOGG,MOK,MON,MON_OLD,MP3,MP4,MPD,MPDSP,MPF,MPG,MPK,MPRO,MPT,MPTM,MS,MSA,MSADPCM,MSB,MSC,MSD,MSF,MSO,MSP,MSS,MSV,MSVP,MT2,MTA2,MTAF,MTK,MTM,MTP2,MTR,MUG,MUG2,MUL,MUPS,MUS,MUSC,MUSX,MW,MWV,MXST,MYSPD,MZ,N64,NAAC,NCSF,NCSFLIB,NDP,NDS,NGCA,NLSD,NOISEPACKER2,NOISEPACKER3,NOP,NP,NP1,NP2,NP3,NPS,NPSF,NR,NRU,NSF,NSFE,NSOPUS,NST,NTP,NTPK,NUB,NUB2,NUS3AUDIO,NUS3BANK,NWA,NWAV,NXA,OCTAMED,OGG,OGL,OKT,OKTA,OMU,ONE,OPI,OPUS,OPUSX,OPX,ORG,OSP,OSS,OTM,OVB,OVI,OXM,OZI,P,P00,P10,P21,P2BT,P30,P3D,P40A,P40B,P41A,P4X,P50A,P5A,P5X,P60,P60A,P61,P61A,P6X,P86,PAP,PAST,PCD,PCM,PDT,PDX,PFLT,PHA,PIN,PIS,PK,PLM,PLX,PM,PM0,PM01,PM1,PM10C,PM18A,PM2,PM20,PM4,PM40,PMB,PMZ,PNB,POLK,PONA,POS,POWT,PP10,PP20,PP21,PP30,PPC,PPK,PPM,PPS,PPZ,PR1,PR2,PRG,PROM,PRU,PRU1,PRU2,PRUN,PRUN1,PRUN2,PS,PS2STM,PSA,PSC,PSF,PSF2,PSF2LIB,PSFLIB,PSG,PSH,PSID,PSM,PSND,PSW,PT,PT1,PT2,PT3,PT36,PTCOP,PTM,PTTUNE,PUMA,PVI,PVP,PWR,PXA,PYG,PYGM,PYGMY,PZI,QC,QPA,QSF,QSFLIB,QTS,R,RAC,RAD,RAK,RAS,RAW,RH,RHO,RIFF,RIX,RJP,RK,RKB,RKV,RMT,RND,ROF,ROL,RPGMVO,RRDS,RSD,RSF,RSID,RSM,RSP,RSTM,RTM,RWAR,RWAV,RWS,RWSD,RWX,RXW,S-C,S14,S3M,S7G,S98,SA,SA-P,SA2,SAB,SAD,SAF,SAP,SAS,SAT,SA_OLD,SB,SB0,SB1,SB2,SB3,SB4,SB5,SB6,SB7,SBIN,SBK,SBR,SBV,SC,SC68,SCD,SCH,SCI,SCL,SCN,SCR,SCT,SCUMM,SD9,SDB,SDF,SDR,SDT,SEB,SED,SEG,SET,SF0,SF2,SFL,SFM,SFS,SFX,SFX13,SFX2,SG,SGB,SGC,SGD,SGX,SID,SID1,SID2,SJS,SKT,SKYT,SL3,SLI,SM,SM0,SM1,SM2,SM3,SM4,SM5,SM6,SM7,SMC,SMK,SMN,SMP,SMPL,SMPRO,SMUS,SMV,SND,SNDH,SNDMON,SNDS,SNG,SNGW,SNK,SNR,SNS,SNSF,SNSFLIB,SNT,SNT!,SNU,SNX,SOC,SOD,SOG,SON,SONGPLAY,SONIC,SOP,SPC,SPD,SPK,SPL,SPM,SPS,SPSD,SPW,SQD,SQT,SQX,SS,SS2,SSD,SSF,SSFLIB,SSM,SSS,ST,ST1,ST2,ST26,ST3,ST30,STAR,STC,STER,STK,STM,STMA,STP,STPK,STR,STREAM,STRM,STS,STX,SUN,SVAG,SVG,SVS,SWAG,SWAV,SWD,SWITCH_AUDIO,SX,SXD,SXD1,SXD2,SXD3,SYN,SYNMOD,SZX,TD0,TEC,TF,TF0,TFC,TFD,TFE,TFHD1.5,TFHD7V,TFHDPRO,TFMX,TFMX1.5,TFMX7V,TFMXPRO,TGQ,TGV,THM,THN,THP,THX,TINY,TK5,TLZ,TLZP,TM2,TM8,TMC,TME,TMX,TP,TP1,TP2,TP3,TPU,TRA,TRC,TRD,TRO,TRONIC,TRS,TS,TUN,TW,TWO,TXT,TXTP,TYDSP,UDS,UE4OPUS,ULT,ULW,UM3,UMX,UN2,UNIC,UNIC2,USF,USFLIB,UTK,UV,V0,V1,V2M,V2MZ,VA3,VAG,VAI,VAS,VAWX,VB,VB2,VBK,VDM,VDS,VGM,VGS,VGV,VGZ,VID,VIG,VIS,VMS,VOI,VP6,VPK,VS,VSF,VSS,VSV,VTX,VXN,WAA,WAC,WAD,WAF,WAM,WAS,WAV,WAVC,WAVE,WAVEBATCH,WAVM,WAY,WB,WB2,WBD,WD,WEM,WII,WLF,WMA,WMUS,WN,WOW,WP2,WPD,WSD,WSI,WSR,WUA,WV2,WV6,WVE,WVS,WVX,X,XA,XA2,XA30,XAD,XAG,XAN,XANN,XAU,XAV,XEN,XM,XMA,XMA2,XMD,XMF,XMS,XMU,XNA,XNB,XOPUS,XPK,XPS,XSE,XSEW,XSF,XSM,XSS,XVAG,XVAS,XWAV,XWB,XWC,XWM,XWMA,XWS,XWV,YDSP,YM,YMF,YMST,ZEN,ZIC,ZSD,ZSM,ZSS,ZWDSP,ZWV,ZXZIP\n統合プレイヤーライブラリ:\n- Adplug\n- Another Slight Atari Player(ASAP)\n- AtariSound\n- Eupmini\n- ffmpeg/mpg123/vorbis\n- Game Music Emu\n- FMPmini\n- Gbsplay\n- Highly Complete\n- AHX/Hively tracker\n- LazyUSF\n- Libvgm\n- Mdxplay\n- NSFPlay\n- OpenMPT\n- PlayGSF\n- Pmdmini\n- PxTone / Organya\n- PT3Player\n- SC68\n- Sibplayfp\n- Snes9x/snsf\n- ST-Sound\n- Timidity(Merlin_gold SF2サウンドフォントを使用)\n- UADE\n- XSF (2SF, NCSF)\n- XMP\n-V2M tinyplayer\n- VGMStream\n- VIO2SF\n- WebNEZ\n- WebNEZ\n- WebSID\n- ZXTune\n\n免責事項:\nModland、HVSC、ASMAライブラリへのインターネットアクセスは現状のまま提供されるサービスであり、可用性や機能の保証はありません。本アプリケーションの使用は自己責任で行ってください。";


// ================================
// MARK: - SUPPORT
// ================================

"Mail support" = "メールサポート";
"Contact support by email" = "メールでサポートに連絡";
"[Please describe your request below]" = "【以下にリクエストをご記入ください】";


// ================================
// MARK: - DONATION / TIPS
// ================================

"Thank You! ❤️" = "ありがとうございます！❤️";
"Send a tip to Modizer" = "Modizerにチップを送る";
"Support Modizer development" = "Modizer開発をサポート";


// ================================
// MARK: - LAUNCH / INITIALIZATION
// ================================

"Cleaning DB & \nreseting settings" = "DB整理中 & \n設定リセット中";
"First launch or issue encountered last time Modizer was running. Apply default settings?" = "初回起動または前回Modizerの実行時に問題が発生しました。デフォルト設定を適用しますか？";


// ================================
// ================================
// MARK: - SIRI / APP INTENTS
// ================================

/* インテントタイトル */
"Play" = "再生";
"Pause" = "一時停止";
"Stop" = "停止";
"Next Song" = "次の曲";
"Previous Song" = "前の曲";
"Play Subsong" = "サブソング再生";
"Seek" = "シーク";
"Set Infinite Loop" = "無限ループ設定";
"Set Loop Mode" = "ループモード設定";
"Set Shuffle Mode" = "シャッフルモード設定";
"Toggle Shuffle" = "シャッフル切替";
"Toggle Loop Mode" = "ループモード切替";
"Set Fullscreen mode" = "全画面モード設定";
"Go the player view" = "プレーヤー表示へ移動";
"Set FX" = "FX設定";
"Get Now Playing" = "再生中の情報取得";
"Get Playlists" = "プレイリスト取得";
"Play some music" = "音楽を再生";
"Play most played" = "よく再生される曲を再生";
"Play favorites" = "お気に入りを再生";
"Play Playlist" = "プレイリスト再生";
"Play Playlist By Name" = "名前でプレイリスト再生";

/* インテント説明 */
"Starts playing music in Modizer." = "Modizerで音楽の再生を開始します。";
"Pauses music playback in Modizer." = "Modizerで音楽の再生を一時停止します。";
"Stops music playback in Modizer." = "Modizerで音楽の再生を停止します。";
"Skips to the next song in Modizer." = "Modizerで次の曲にスキップします。";
"Skips to the previous song in Modizer." = "Modizerで前の曲にスキップします。";
"Plays a specific subsong in the current file." = "現在のファイル内の特定のサブソングを再生します。";
"Seeks to a specific position in the current song." = "現在の曲の特定の位置にシークします。";
"Set the infinite loop mode in Modizer." = "Modizerで無限ループモードを設定します。";
"Set the loop mode in Modizer." = "Modizerでループモードを設定します。";
"Set the shuffle mode in Modizer." = "Modizerでシャッフルモードを設定します。";
"Toggles shuffle mode in Modizer." = "Modizerでシャッフルモードを切り替えます。";
"Toggles loop mode in Modizer." = "Modizerでループモードを切り替えます。";
"Set Fullscreen mode on or off in Modizer." = "Modizerで全画面モードのオン/オフを設定します。";
"Go the player view in Modizer." = "Modizerでプレーヤー表示に移動します。";
"Set FX mode in Modizer." = "ModizerでFXモードを設定します。";
"Gets information about the currently playing song." = "現在再生中の曲の情報を取得します。";
"Gets the list of available playlists in Modizer." = "Modizerで利用可能なプレイリストのリストを取得します。";
"Random picks from available local titles in Modizer." = "Modizerで利用可能なローカルタイトルからランダムに選択します。";
"Most played titles from available local titles in Modizer." = "Modizerで利用可能なローカルタイトルから最も再生された曲を選択します。";
"Favorites titles from available local titles in Modizer." = "Modizerで利用可能なローカルタイトルからお気に入りの曲を選択します。";
"Plays a specific playlist in Modizer. Note: For best results with voice commands, use 'Play Playlist By Name' instead." = "Modizerで特定のプレイリストを再生します。注：音声コマンドで最良の結果を得るには、代わりに「名前でプレイリスト再生」を使用してください。";
"Plays a playlist by name in Modizer. Recommended for voice commands." = "Modizerで名前でプレイリストを再生します。音声コマンドに推奨されます。";

/* パラメータ */
"Subsong Index" = "サブソングインデックス";
"The index of the subsong to play" = "再生するサブソングのインデックス";
"Position (seconds)" = "位置（秒）";
"The position to seek to in seconds" = "シークする位置（秒単位）";
"Relative" = "相対";
"Whether to seek relative to current position" = "現在位置からの相対シークかどうか";
"Infinite Loop Mode" = "無限ループモード";
"0: off, 1: infinite loop" = "0: オフ、1: 無限ループ";
"Repeat Mode" = "リピートモード";
"0: off, 1: loop current title, 2: loop playlist" = "0: オフ、1: 現在のタイトルをループ、2: プレイリストをループ";
"Shuffle Mode" = "シャッフルモード";
"0: off, 1: choose only one title if file has subsongs or is an archive, 2: play all titles of a given file" = "0: オフ、1: ファイルにサブソングがある場合またはアーカイブの場合は1つのタイトルのみ選択、2: 指定されたファイルのすべてのタイトルを再生";
"Fullscreen mode" = "全画面モード";
"Activate (1) or disactivate (0) Fullscreen mode" = "全画面モードを有効化（1）または無効化（0）";
"FX" = "FX";
"The FX to set" = "設定するFX";
"FX Mode" = "FXモード";
"The mode to activate for the selected FX (0:off)" = "選択したFXに対して有効にするモード（0:オフ）";
"Playlist" = "プレイリスト";
"The playlist to play" = "再生するプレイリスト";
"Start Index" = "開始インデックス";
"The index of the song to start playing from (0-based)" = "再生を開始する曲のインデックス（0ベース）";
"Playlist Name" = "プレイリスト名";
"The name of the playlist to play" = "再生するプレイリストの名前";
"Which playlist would you like to play?" = "どのプレイリストを再生しますか？";

/* ダイアログメッセージ */
"play_playlist_dialog" = "プレイリスト %@ を再生中";
"Playlist not found. Use 'Get Playlists' to see available playlists." = "プレイリストが見つかりません。「プレイリスト取得」を使用して利用可能なプレイリストを表示してください。";
"No playlists found" = "プレイリストが見つかりません";

/* FX名 */
"ProjectM" = "ProjectM";
"Oscillo" = "オシロスコープ";
"Piano roll" = "ピアノロール";
"3D Piano" = "3Dピアノ";
"Notes bars" = "ノートバー";
"Tracker" = "トラッカー";
"2D Spectrum" = "2Dスペクトラム";
"3D Spectrum" = "3Dスペクトラム";
"3D Landscape" = "3D風景";

// ================================

"Get Now Playing" = "再生中を取得";
"Which playlist would you like to play?" = "どのプレイリストを再生しますか？";


// ================================


// ================================
// MARK: - VOICE COMMANDS UI
// ================================

"Voice Commands" = "音声コマンド";
"Siri voice commands for Modizer" = "ModizerのSiri音声コマンド";
"Voice Commands: Playback" = "再生";
"Voice Commands: Navigation" = "ナビゲーション";
"Voice Commands: Playlists" = "プレイリスト";
"Voice Commands: Modes" = "モード";
// MARK: - TABS
// ================================

"Search" = "検索";
"More" = "その他";
"Suspend" = "一時停止";
"Clear all" = "すべてクリア";
"Online" = "オンライン";


// ================================
// MARK: - MORE TAB
// ================================

"About" = "について";
"Some general informations" = "一般的な情報";
"Settings" = "設定";
"Global, Visu, FTP & Plugins" = "全般、ビジュアライゼーション、FTP、プラグイン";
"Maintenance" = "メンテナンス";
"Clean DB, Reset ratings, ..." = "DB整理、評価リセット、...";


// ================================
// MARK: - ONLINE TAB / COLLECTIONS
// ================================

/* Section Headers */
"Collections" = "コレクション";
"Browse Internet" = "インターネットをブラウズ";
"Games Music" = "ゲーム音楽";
"Mods & chiptunes" = "Mod & チップチューン";
"Other" = "その他";

/* Collections */
"MODLAND collection" = "MODLANDコレクション";
"AMP collection" = "AMPコレクション";
"HVSC collection" = "HVSCコレクション";
"ASMA collection" = "ASMAコレクション";
"JOSHW collection" = "JOSHWコレクション";
"VGMRips collection" = "VGMRipsコレクション";
"SNESmusic collection" = "SNESmusicコレクション";
"SMS Power! collection" = "SMS Power!コレクション";
"ZXArt collection" = "ZXArtコレクション";

/* Collection Descriptions */
"%d entries" = "%d 件";
"Thousands of entries" = "数千件のエントリ";
"4K+ packs / 70K+ songs" = "4000以上のパック / 70000以上の曲";
"1500+ sets / Super Nintendo/Famicom" = "1500以上のセット / スーパーファミコン";
"Master System & Game gear sets" = "マスターシステム & ゲームギアセット";
"ZX Spectrum" = "ZX Spectrum";

/* Internet */
"Modizer World Charts" = "Modizerワールドチャート";
"Web browser" = "ウェブブラウザ";
"No internet connectivity or website down." = "インターネット接続がないか、ウェブサイトがダウンしています";

// ================================
// MARK: - SETTINGS - FAMILIES & UI
// ================================

/* Settings Families */
"Global" = "全般";
"Default Players" = "デフォルトプレイヤー";
"Visualizers" = "ビジュアライザ";
"PR & NS colors settings" = "PR & NS色設定";
"Plugins" = "プラグイン";

/* Player Selection */
"MOD player" = "MODプレイヤー";
"SAP player" = "SAPプレイヤー";
"SID player" = "SIDプレイヤー";
"VGM player" = "VGMプレイヤー";
"YM player" = "YMプレイヤー";
"NSF player" = "NSFプレイヤー";
"PT3 player" = "PT3プレイヤー";
"GBS player" = "GBSプレイヤー";
"KSS player" = "KSSプレイヤー";
"2SF player" = "2SFプレイヤー";
"MIDI player" = "MIDIプレイヤー";

/* Global Player Settings - Additional Descriptions */
"Only for plugins supporting this feature (GME, NSFPLAY, LIBVGM)" = "この機能をサポートするプラグインのみ（GME、NSFPLAY、LIBVGM）";
"0=auto, delay rounded to a multiple of audio buffer size" = "0=自動、オーディオバッファサイズの倍数に丸められた遅延";
"Limited: not for subsong" = "制限あり: サブソングには適用されません";
"Default value is 3s" = "デフォルト値は3秒";
"Default action when selecting an archive or a multisong file" = "アーカイブまたはマルチソングファイルを選択した際のデフォルトアクション";
"Play only selected entry or full archive/multisong file" = "選択したエントリのみを再生、またはアーカイブ/マルチソングファイル全体を再生";
"Show Welcome screen" = "ウェルカム画面を表示";
"Adplug priority for module" = "モジュール用Adplugの優先度";

/* FTP Settings */
"Server status" = "サーバーステータス";
"FTP Server" = "FTPサーバー";
"Authorize anonymous" = "匿名を許可";
"User" = "ユーザー";
"Password" = "パスワード";
"Port" = "ポート";

/* Online Settings */
"MODLAND URL" = "MODLAND URL";
"HVSC URL" = "HVSC URL";
"ASMA URL" = "ASMA URL";
"MODLAND Server" = "MODLANDサーバー";
"MODLAND cust.URL" = "MODLANDカスタムURL";
"HVSC Server" = "HVSCサーバー";
"HVSC cust.URL" = "HVSCカスタムURL";
"ASMA Server" = "ASMAサーバー";
"ASMA cust.URL" = "ASMAカスタムURL";


// ================================
// MARK: - SETTINGS - ADDITIONAL PLUGIN SETTINGS
// ================================

/* Visualization - MOD Pattern */
"Patterns BG Alpha" = "パターン背景アルファ";
"Opacity of mod patterns view" = "modパターンビューの不透明度";
"MOD Color Theme" = "MODカラーテーマ";
"MOD Current Line" = "MOD現在行";
"MOD Volume bars" = "MODボリュームバー";
"MOD Pattern Font" = "MODパターンフォント";
"MOD Pattern Font Size" = "MODパターンフォントサイズ";

/* Visualization - Piano Roll / MIDI */
"Piano Roll FX" = "ピアノロールFX";
"PR/Spark FX" = "PR/スパークFX";
"Display voices label" = "ボイスラベルを表示";
"Notes scroller FX" = "ノートスクローラーFX";
"NS/bars mode" = "NS/バーモード";
"NS/bars style" = "NS/バースタイル";
"Vibrato display" = "ビブラート表示";
"Piano FX" = "ピアノFX";
"Piano bars mode" = "ピアノバーモード";

/* Visualization - Spectrum */
"3D Sp.Bloom" = "3Dスペクトラムブルーム";
"3D Land. Bloom" = "3Dランドスケープブルーム";
"0: off" = "0: オフ";

/* ProjectM Settings */
"ProjectM FX" = "ProjectM FX";
"Rendering quality: Max is pixel resolution, 1/2 is half, ..." = "レンダリング品質: 最大はピクセル解像度、1/2は半分、...";
"Custom presets/textures should be copied in .projectm folder" = "カスタムプリセット/テクスチャは.projectmフォルダにコピーしてください";
"Display preset name" = "プリセット名を表示";
"Lim: display and disappear quickly" = "制限: 表示後すぐに消える";
"Auto switch presets" = "プリセット自動切替";
"Allow loading of milk file with script issues" = "スクリプトに問題のあるmilkファイルの読み込みを許可";
"Default is 15s" = "デフォルトは15秒";
"Default is 2.7s" = "デフォルトは2.7秒";
"Default value is 32" = "デフォルト値は32";
"Default value is 24" = "デフォルト値は24";
"Default value is 20" = "デフォルト値は20";
"Hardcut" = "ハードカット";
"Hardcut triggers presets switch synchronized with beats." = "ハードカットはビートに同期してプリセットを切り替えます";
"Hardcut min time" = "ハードカット最小時間";
"Preserve aspect ratio for compatible shaders." = "互換性のあるシェーダーのアスペクト比を維持";
"Default value is 1" = "デフォルト値は1";
"Hardcut sensitivity" = "ハードカット感度";

/* Oscilloscope Settings */
"Oscillo FX" = "オシロスコープFX";
"Oscillo show labels" = "オシロスコープラベル表示";
"Oscillo labels font size" = "オシロスコープラベルフォントサイズ";
"Oscillo show grid" = "オシロスコープグリッド表示";
"Oscillo line width" = "オシロスコープ線幅";
"Reset all custom colors" = "すべてのカスタム色をリセット";
"Multi color | System 1" = "マルチカラー | システム1";
"Multi color | System 2" = "マルチカラー | システム2";
"Multi color | System 3" = "マルチカラー | システム3";
"Multi color | System 4" = "マルチカラー | システム4";
"Multi color | System 5" = "マルチカラー | システム5";
"Multi color | System 6" = "マルチカラー | システム6";
"Multi color | System 7" = "マルチカラー | システム7";
"Multi color | System 8" = "マルチカラー | システム8";

/* Piano/MIDI Colors */
"Custom color 01" = "カスタムカラー01";
"Custom color 02" = "カスタムカラー02";
"Custom color 03" = "カスタムカラー03";
"Custom color 04" = "カスタムカラー04";
"Custom color 05" = "カスタムカラー05";
"Custom color 06" = "カスタムカラー06";
"Custom color 07" = "カスタムカラー07";
"Custom color 08" = "カスタムカラー08";
"Custom color 09" = "カスタムカラー09";
"Custom color 10" = "カスタムカラー10";
"Custom color 11" = "カスタムカラー11";
"Custom color 12" = "カスタムカラー12";
"Custom color 13" = "カスタムカラー13";
"Custom color 14" = "カスタムカラー14";
"Custom color 15" = "カスタムカラー15";
"Custom color 16" = "カスタムカラー16";
"Custom color 17" = "カスタムカラー17";
"Custom color 18" = "カスタムカラー18";
"Custom color 19" = "カスタムカラー19";
"Custom color 20" = "カスタムカラー20";
"Custom color 21" = "カスタムカラー21";
"Custom color 22" = "カスタムカラー22";
"Custom color 23" = "カスタムカラー23";
"Custom color 24" = "カスタムカラー24";
"Custom color 25" = "カスタムカラー25";
"Custom color 26" = "カスタムカラー26";
"Custom color 27" = "カスタムカラー27";
"Custom color 28" = "カスタムカラー28";
"Custom color 29" = "カスタムカラー29";
"Custom color 30" = "カスタムカラー30";
"Custom color 31" = "カスタムカラー31";
"Custom color 32" = "カスタムカラー32";

/* Plugin Settings - Libopenmpt */
"Libopenmpt" = "Libopenmpt";

/* Plugin Settings - GME */
"GME" = "GME";
"Will skip song if nothing is played for specified duration (0=off)" = "指定時間何も再生されない場合に曲をスキップ (0=オフ)";

/* Plugin Settings - GSF */
"GSF" = "GSF";

/* Plugin Settings - NSFPLAY */
"NSFPLAY" = "NSFPLAY";
"Default length" = "デフォルト長さ";
"Oversampling. Min=0, default: 10" = "オーバーサンプリング。最小=0、デフォルト: 10";
"Min=off, default: 112" = "最小=オフ、デフォルト: 112";
"Max=off, default: 164" = "最大=オフ、デフォルト: 164";
"1/2/3=NTSC/PAL/DENDY\n4/5/6=force NTSC/PAL/DENDY" = "1/2/3=NTSC/PAL/DENDY\n4/5/6=強制NTSC/PAL/DENDY";
"Forces IRQ capability for all NSFs, not just NSF2" = "NSF2だけでなくすべてのNSFにIRQ機能を強制";
"APU unmute on reset" = "APUリセット時にミュート解除";
"APU phase reset" = "APU位相リセット";
"APU non linear mixing" = "APU非線形ミキシング";
"APU swap duty 1/2" = "APU デューティ1/2入れ替え";
"APU Initialize sweep unmute" = "APU スイープ初期化ミュート解除";
"DMC enable $4011 writes" = "DMC $4011書き込み有効";
"DMC enable periodic noise" = "DMC 周期的ノイズ有効";
"DMC unmute on reset" = "DMC リセット時にミュート解除";
"DMC anti clicking" = "DMC アンチクリック";
"DMC non linear mixer" = "DMC 非線形ミキサー";
"DMC randomize noise on reset" = "DMC リセット時にノイズをランダム化";
"DMC mute triangle on pitch 0" = "DMC ピッチ0で三角波をミュート";
"prevents high frequency aliasing" = "高周波エイリアシングを防止";
"DMC rand. triangle" = "DMC ランダム三角波";
"randomize triangle on reset" = "リセット時に三角波をランダム化";
"DMC reverse bits" = "DMC ビット反転";
"reverse bits of DPCM sample bytes" = "DPCMサンプルバイトのビットを反転";
"MMC5 non linear mixing" = "MMC5 非線形ミキシング";
"MMC5 Phase reset" = "MMC5 位相リセット";
"Reset phase counter after write $5003 and $5007" = "$5003と$5007書き込み後に位相カウンタをリセット";
"FDS LP filter in Hz" = "FDS LPフィルタ (Hz)";
"Cutoff frequency (0Hz=off, 2000Hz=default)" = "カットオフ周波数 (0Hz=オフ、2000Hz=デフォルト)";
"FDS reset \"phase\"" = "FDS 「位相」をリセット";
"$4085 \"resets\" modular phase" = "$4085 モジュラー位相を「リセット」";
"FDS write protect" = "FDS 書き込み保護";
"write protect $8000-DFFF" = "$8000-DFFFを書き込み保護";
"VRC7 Replace with OPLL" = "VRC7 OPLLで置換";
"N163 Serial Multiplex mixing" = "N163 シリアルマルチプレックスミキシング";
"N163 Write Protect Phase" = "N163 書き込み保護位相";
"N163 Limit Wavelength" = "N163 波長制限";

/* Plugin Settings - ADPLUG */
"ADPLUG" = "ADPLUG";

/* Plugin Settings - HC (Highly Complete) */
"HC" = "HC";
"Only for HC plugin" = "HCプラグインのみ";

/* Plugin Settings - SID */
"SID" = "SID";
"Digiboost" = "デジブースト";

/* Plugin Settings - TIMIDITY */
"TIMIDITY" = "TIMIDITY";

/* Plugin Settings - UADE */
"UADE" = "UADE";
"Panning value" = "パンニング値";
"Gain value" = "ゲイン値";

/* Plugin Settings - VGMPlay */
"VGMPLAY" = "VGMPLAY";

/* Plugin Settings - VGMStream */
"VGMSTREAM" = "VGMSTREAM";

/* Plugin Settings - XMP */
"XMP" = "XMP";

/* Plugin Settings - SEXYPSF */
"SEXYPSF" = "SEXYPSF";

/* Plugin Settings - GBSPlay */
"GBS" = "GBS";

/* Plugin Settings - STSOUND */
"STSOUND" = "STSOUND";

/* Plugin Settings - SC68 */
"SC68" = "SC68";

/* Additional Settings */
"Disable" = "無効";
"Enter playlist name" = "プレイリスト名を入力";
"Ask" = "確認";
"Play All" = "すべて再生";
"Single" = "単一";
"Archive" = "アーカイブ";
"On" = "オン";
"Off" = "オフ";
"Lim" = "制限";

// ================================
// MARK: - PLAYLISTS - ADDITIONAL ENTRIES
// ================================

/* Playlist Menu Entries */
"Add a playlist" = "プレイリストを追加";
"Create a new playlist" = "新規プレイリストを作成";
"Now playing" = "再生中";
"1 entry" = "1件";
"No entry" = "エントリなし";
"Random picks" = "ランダム選択";
"Generate a randomized playlist" = "ランダムプレイリストを生成";
"Most played" = "よく再生";
"Favorites" = "お気に入り";

/* Playlist Actions */
"Add/Remove files..." = "ファイルを追加/削除...";
"More actions..." = "その他のアクション...";
"Save as a new playlist" = "新規プレイリストとして保存";

// ================================
// MARK: - WELCOME PAGES
// ================================

"Welcome to Modizer!\n" = "Modizerへようこそ！\n";
"Level up your library." = "ライブラリをレベルアップ";
"Sound meets visuals." = "サウンドとビジュアルの融合";
"Made with passion,\noffered for free." = "情熱を込めて作成、\n無料で提供";

/* Welcome Page Messages */
"Your gateway to retro and tracker music.\nPower up your device with legendary game tunes, iconic tracker modules, and timeless chiptune classics." = "レトロ音楽とトラッカー音楽へのゲートウェイ\n伝説のゲーム音楽、象徴的なトラッカーモジュール、時代を超えたチップチューンの名曲でデバイスをパワーアップ。";

"Browse and stream from online catalogs, to complete your own collections.\nBuild, edit, and listen to playlists effortlessly." = "オンラインカタログからブラウズ・ストリーミングして、自分のコレクションを完成させましょう\nプレイリストを簡単に作成、編集、再生できます。";

"Unlock classic oscilloscope looks, spectrum bars, piano rolls, trackers view and ProjectM/Milkdrop FX. Let Modizer paint each track with motion and color." = "クラシックなオシロスコープ、スペクトラムバー、ピアノロール、トラッカービュー、ProjectM/Milkdrop FXを解放。Modizerが各トラックを動きと色で彩ります。";

"If you enjoy the app, tips are a great way to support its ongoing development.\nThank you for helping keep Modizer alive and evolving." = "アプリを楽しんでいただけましたら、チップは継続的な開発をサポートする素晴らしい方法です\nModizerを維持し、進化させるためのご支援に感謝いたします。";

"Skip" = "スキップ";

// ================================
// MARK: - TIPS / DONATIONS
// ================================

/* Tips Screen */
"Support with a Tip" = "チップでサポート";
"Enjoy Modizer ?" = "Modizerを楽しんでいますか？";
"Your support helps keep Modizer running and ad-free!" = "あなたのサポートがModizerを広告なしで運営し続けることを可能にします！";
"Already tipped so far" = "これまでにいただいたチップ";
"Thank you for your support! ❤️" = "ご支援ありがとうございます！❤️";

/* Tip Tiers */
"Coffee" = "コーヒー";
"Coffee & Croissant" = "コーヒー & クロワッサン";
"Dinner" = "ディナー";
"Loading..." = "読み込み中...";

/* Tip Actions */
"Confirm Tip" = "チップを確認";
"Send Tip" = "チップを送る";
"Send a %@ tip for %@?" = "%@のために%@のチップを送りますか？";
"Tip" = "チップ";

/* Tip Errors */
"Unable to load products. Please check your internet connection." = "商品を読み込めません。インターネット接続を確認してください";

/* Thank You Alert */
"Thank You! ❤️" = "ありがとうございます！❤️";
"Your support means everything! Thank you for helping keep Modizer running." = "あなたのサポートがすべてです！Modizerの運営を支えてくださり、ありがとうございます";

// ================================
// MARK: - MAINTENANCE SCREEN
// ================================

/* Maintenance Actions */
"Clean Database" = "データベースをクリーン";
"Clear 'Now Playing' queue" = "「再生中」キューをクリア";
"Recreate Samples folder" = "サンプルフォルダを再作成";
"Reset settings to default" = "設定をデフォルトにリセット";
"Remove current cover" = "現在のカバーを削除";
"Reset Ratings" = "評価をリセット";
"Reset Played Counters" = "再生回数をリセット";
"Reset Database" = "データベースをリセット";
"Clear images cache" = "画像キャッシュをクリア";

/* Maintenance Messages */
"Settings reseted" = "設定をリセットしました";
"Ratings reseted" = "評価をリセットしました";
"Played Counters reseted" = "再生回数をリセットしました";
"Samples folder created" = "サンプルフォルダを作成しました";
"Cache cleaned" = "キャッシュをクリアしました";
"Database reseted" = "データベースをリセットしました";
"No cover to remove" = "削除するカバーがありません";
"Cover removed" = "カバーを削除しました";
"Database cleaned" = "データベースをクリーンしました";

/* Maintenance Confirmations */
"Are you sure you want to clean the DB, it might take a while ?" = "データベースをクリーンしてもよろしいですか？時間がかかる場合があります";
"Clean" = "クリーン";
"Cleaning DB" = "データベースをクリーン中";
"Cancelling..." = "キャンセル中...";

// ================================
// MARK: - PLAYERMENU
// ================================

"Close FX
window" = "FXウィンドウ
を閉じる";
"All FX off" = "すべての
FXを
オフ";
"FX
alpha" = "FX
透明度";
"Show name
temp." = "名前を
一時表示";
"Show name" = "名前を
表示";
"Bundled
presets" = "バンドル
プリセット";
"Custom
presets" = "カスタム
プリセット";
"Blend
presets" = "プリセット
をブレンド";
"Clear
all" = "すべて
クリア";
"Select
all" = "すべて
選択";
"Favorites" = "お気に入り";
"Expand" = "展開";
"Select
listed" = "リスト
を選択";
"Remove
listed" = "リスト
を削除";
"Selected" = "選択済み";
"Collapse" = "折りたたむ";
"Labels" = "ラベル";
"Grid" = "グリッド";
"Voices
labels" = "ボイス
ラベル";
"Octaves
labels" = "オクターブ
ラベル";
"Volume
bars" = "ボリューム
バー";
"Fixed bar" = "固定バー";
"BG
opacity" = "背景
透明度";
"Bloom:
%s" = "ブルーム:
%s";
"Thickness:
%s" = "太さ:
%s";
"Font size
%s" = "フォントサイズ
%s";
"Font:
%s" = "フォント:
%s";
"Info HUD:
%s" = "情報HUD:
%s";
"Select active %s presets" = "アクティブな%sプリセットを選択";
"bundled" = "バンドル";
"custom" = "カスタム";
"Select
custom
presets" = "カスタム
プリセット
を選択";
"Select
bundled
presets" = "バンドル
プリセット
を選択";
"Themes:
%s" = "テーマ:
%s";



// MARK: - Voice Commands phrases
"Play some music in Modizer" = "Modizerで音楽を再生";
"Start random playlist in Modizer" = "Modizerでランダム再生";
"Play favorites in Modizer" = "Modizerでお気に入りを再生";
"Start favorites playlist in Modizer" = "Modizerのお気に入りを再生";
"Play most played in Modizer" = "Modizerで最も再生された曲を再生";
"Start most played playlist in Modizer" = "Modizerの人気曲を再生";
"Play a playlist in Modizer" = "Modizerでプレイリストを再生";
"Start a playlist in Modizer" = "Modizerのプレイリスト";
"Toggle shuffle mode in Modizer" = "Modizerのシャッフルモードを切り替え";
"Change shuffle mode in Modizer" = "Modizerのランダム再生を変更";
"Change loop mode in Modizer" = "Modizerのリピートモードを変更";
"Toggle repeat in Modizer" = "Modizerの繰り返しを切り替え";
"What's playing in Modizer" = "Modizerで再生中の曲";
"Current song in Modizer" = "Modizerの現在の曲";

"Voices commands aren't supported in MacOS." = "macOSでは音声コマンドはサポートされていません。";

/* Error messages */
"playlist_not_found_error" = "プレイリストが見つかりません。「プレイリストを取得」を使用して利用可能なプレイリストを確認してください。";
"playlist_empty_error" = "このプレイリストにはエントリがありません。まず音楽を追加してください。";

"%@ (name)" = "%@ (名前)";
  "%@ (packs)" = "%@ (パック)";
  "%@ (rating)" = "%@ (評価)";
  "2D Spectrum settings" = "2Dスペクトラム設定";
  "3D landscape settings" = "3Dランドスケープ設定";
  "3D spectrum settings" = "3Dスペクトラム設定";
  "Auto\nscaling" = "自動\nスケール";
  "BG\nopacity" = "背景\n透明度";
  "Blend\npresets" = "ブレンド\nプリセット";
  "Bloom:\n%s" = "ブルーム:\n%s";
  "Bundled\npresets" = "付属\nプリセット";
  "CGSC collection" = "CGSCコレクション";
  "Clear\nall" = "すべて\nクリア";
  "Close FX\nwindow" = "FXウィンドウ\nを閉じる";
  "CoverLibraryFolder" = "現在のライブラリフォルダのカバーとして";
  "Custom\npresets" = "カスタム\nプリセット";
  "FX\nalpha" = "FX\n透明度";
  "Feeling lucky" = "ラッキー";
  "Font size\n%s" = "フォントサイズ\n%s";
  "Font:\n%s" = "フォント:\n%s";
  "Hide MIDI & Piano FX" = "MIDI & ピアノ FXを非表示";
  "Hide other note based FX if displayed (Piano, Midi)" = "表示されている場合、他のノートベースFXを非表示にする (Piano, Midi)";
  "Info HUD:\n%s" = "情報HUD:\n%s";
  "JoshW Covers" = "JoshWカバー";
  "Limit applied in Radio mode to avoid downloading too big files." = "大きすぎるファイルのダウンロードを避けるため、ラジオモードで制限が適用されます。";
  "MIDI pattern settings" = "MIDIパターン設定";
  "MOD Pattern settings" = "MODパターン設定";
  "Next: %@" = "次: %@";
  "Next: loading..." = "次: 読み込み中...";
  "Octaves\nlabels" = "オクターブ\nラベル";
  "Piano 3D settings" = "3Dピアノ設定";
  "Piano roll settings" = "ピアノロール設定";
  "Radio download limit" = "ラジオダウンロード制限";
  "Radio mode" = "ラジオモード";
  "Remove\nlisted" = "リストから\n削除";
  "Select\nall" = "すべて\n選択";
  "Select\nbundled\npresets" = "付属プリセット\nを選択";
  "Select\ncustom\npresets" = "カスタムプリセット\nを選択";
  "Select\nlisted" = "リストを\n選択";
  "Show name\ntemp." = "名前を一時的に\n表示";
  "Themes:\n%s" = "テーマ:\n%s";
  "Thickness:\n%s" = "太さ:\n%s";
  "Try to download covers from TGDB or MobyGames." = "TGDBまたはMobyGamesからカバーをダウンロードしてみる。";
  "Voices\nlabels" = "ボイス\nラベル";
  "Volume\nbars" = "音量\nバー";

/* Cloud */
  "Add Cloud Source" = "クラウドソースを追加";
  "Browse iCloud, Dropbox, OneDrive..." = "iCloud、Dropbox、OneDriveを参照...";
  "Name this source" = "このソースに名前を付ける";
  "Enter a name for this cloud folder" = "このクラウドフォルダの名前を入力してください";
  "Cloud Folder" = "クラウドフォルダ";
  "Add" = "追加";
  "This cloud folder was added but may not persist after the app is closed. Some cloud providers don't support persistent access." =
  "このクラウドフォルダは追加されましたが、アプリを閉じると保持されない場合があります。一部のクラウドプロバイダーは永続的なアクセスをサポートしていません。";
  "File cannot be downloaded.\nPlease check your internet connection." = "ファイルをダウンロードできません。\nインターネット接続を確認してください。";
  "Downloading from\ncloud..." = "クラウドから\nダウンロード中...";
  "Download timed out. Please try again later." = "ダウンロードがタイムアウトしました。後でもう一度お試しください。";
  "available" = "利用可能";
